xml/002085_Create_Topup_Account.xml

Request Message
<soapenv:Envelope xmlns:q0="http://service.bni.co.id/core" xmlns:bo="http://service.bni.co.id/core/bo" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <q0:transaction>
         <request>
            <systemId>NEWIBANK-CORE</systemId>
            <content xsi:type="bo:CreateTopUpAccountReq">
               <accountNumber/>
               <cifNum>9100132052</cifNum>
               <idNumber>3125247587695245</idNumber>
               <idType>1</idType>
               <customerName>Bpk   BAMBANG</customerName>
               <address1>JLN. SETIABUDI V NO 17 GG 3</address1>
               <address2>01 05</address2>
               <npwp>N</npwp>
               <address3>SETIABUDI</address3>
               <nationality>ID</nationality>
               <address4>Setia Budi</address4>
               <postalCode>12910</postalCode>
               <accountType>2981</accountType>
               <subCategory>1001</subCategory>
               <interestPayMethod>R</interestPayMethod>
               <interestAffAccount/>
               <freeFeeProfile/>
               <languageCode/>
               <accFrekuensi/>
               <accConsolidate/>
               <indTglStatus/>
               <correspondentInd/>
               <notificationInd/>
               <customerNotification/>
               <interestRateVar>0</interestRateVar>
               <interestFrequency/>
               <siklus/>
               <day/>
               <agentCode/>
               <investmentType/>
               <address5/>
               <indGroup/>
               <accntNumber5/>
               <applicationID/>
               <defaultString19/>
               <defaultString20/>
               <defInteger7/>
               <defInteger13/>
               <defaultString21/>
               <unsigned08>0</unsigned08>
               <groupTierID/>
               <domesticRisk>08</domesticRisk>
               <crossRisk/>
               <crossBorderRisk/>
               <guarantieInd/>
               <termLimit/>
               <defaultString18/>
               <glClassfication/>
               <openDate>0000-00-00</openDate>
               <copySummary/>
               <notipros/>
               <extractionInd/>
               <appropriateRate>0</appropriateRate>
               <valasClausul/>
               <valuta/>
               <interestChangeInd/>
               <herTaksasiInd/>
               <brokerNo1/>
               <defInteger8/>
               <tprRate/>
               <certNo1/>
               <noIns/>
               <insuranceAccNo/>
               <openAcctRes>2</openAcctRes>
               <openAcctRes1/>
               <srcOfFund>1</srcOfFund>
               <srcOfFund1/>
               <projDep>0</projDep>
               <projWdl>0</projWdl>
               <acctRatio>0</acctRatio>
               <bicNo/>
               <bicLimit>0</bicLimit>
               <insuTerm>24</insuTerm>
               <autoClose>R</autoClose>
               <autoPremium>Y</autoPremium>
               <monthPay>1000000</monthPay>
               <addCover>0</addCover>
               <affiAcctNo>115346360</affiAcctNo>
               <insuAcctNo/>
               <princArrears/>
               <premcArrears/>
               <addSkim>1</addSkim>
			   <monthlyDebitingDate>5</monthlyDebitingDate>
               <sourceAccount>115349010</sourceAccount>
            </content>
         </request>
      </q0:transaction>
   </soapenv:Body>
</soapenv:Envelope>


Response Message:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:dpss0="bons">
   <soapenv:Header/>
   <soapenv:Body>
      <core:transactionResponse xmlns:bo="http://service.bni.co.id/core/bo" xmlns:core="http://service.bni.co.id/core">
         <response>
            <header>
               <coreJournal>076145</coreJournal>
            </header>
            <content xsi:type="bo:OKMessage">
               <message>O.K. 003         11535286-2 0996 001 00001 00000000000000000+ 000000</message>
            </content>
         </response>
      </core:transactionResponse>
   </soapenv:Body>
</soapenv:Envelope>


Request Error Message:
<soapenv:Envelope xmlns:q0="http://service.bni.co.id/core" xmlns:bo="http://service.bni.co.id/core/bo" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <q0:transaction>
         <request>
            <systemId>NEWIBANK-CORE</systemId>
            <content xsi:type="bo:CreateTopUpAccountReq">
               <accountNumber/>
               <cifNum>9100132052</cifNum>
               <idNumber>3125247587695245</idNumber>
               <idType>1</idType>
               <customerName>Bpk   BAMBANG</customerName>
               <address1>JLN. SETIABUDI V NO 17 GG 3</address1>
               <address2>01 05</address2>
               <npwp>N</npwp>
               <address3>SETIABUDI</address3>
               <nationality>ID</nationality>
               <address4>Setia Budi</address4>
               <postalCode>12910</postalCode>
               <accountType>2981</accountType>
               <subCategory>1001</subCategory>
               <interestPayMethod>R</interestPayMethod>
               <interestAffAccount/>
               <freeFeeProfile/>
               <languageCode/>
               <accFrekuensi/>
               <accConsolidate/>
               <indTglStatus/>
               <correspondentInd/>
               <notificationInd/>
               <customerNotification/>
               <interestRateVar>0</interestRateVar>
               <interestFrequency/>
               <siklus/>
               <day/>
               <agentCode/>
               <investmentType/>
               <address5/>
               <indGroup/>
               <accntNumber5/>
               <applicationID/>
               <defaultString19/>
               <defaultString20/>
               <defInteger7/>
               <defInteger13/>
               <defaultString21/>
               <unsigned08>0</unsigned08>
               <groupTierID/>
               <domesticRisk>08</domesticRisk>
               <crossRisk/>
               <crossBorderRisk/>
               <guarantieInd/>
               <termLimit/>
               <defaultString18/>
               <glClassfication/>
               <openDate>0000-00-00</openDate>
               <copySummary/>
               <notipros/>
               <extractionInd/>
               <appropriateRate>0</appropriateRate>
               <valasClausul/>
               <valuta/>
               <interestChangeInd/>
               <herTaksasiInd/>
               <brokerNo1/>
               <defInteger8/>
               <tprRate/>
               <certNo1/>
               <noIns/>
               <insuranceAccNo/>
               <openAcctRes>2</openAcctRes>
               <openAcctRes1/>
               <srcOfFund>1</srcOfFund>
               <srcOfFund1/>
               <projDep>0</projDep>
               <projWdl>0</projWdl>
               <acctRatio>0</acctRatio>
               <bicNo/>
               <bicLimit>0</bicLimit>
               <insuTerm>24</insuTerm>
               <autoClose>R</autoClose>
               <autoPremium>Y</autoPremium>
               <monthPay>1000000</monthPay>
               <addCover>0</addCover>
               <affiAcctNo>1231</affiAcctNo>
               <insuAcctNo/>
               <princArrears/>
               <premcArrears/>
               <addSkim>1</addSkim>
			   <monthlyDebitingDate>5</monthlyDebitingDate>
               <sourceAccount>115344578</sourceAccount>
            </content>
         </request>
      </q0:transaction>
   </soapenv:Body>
</soapenv:Envelope>

Response Error Message:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:p="http://service.bni.co.id/core">
  <soapenv:Header />
  <soapenv:Body>
    <soapenv:Fault xmlns:m="http://service.bni.co.id/core">
      <faultcode>m:AppFault</faultcode>
      <faultstring>1811</faultstring>
      <detail encodingStyle="">
        <core:transaction_appFault xmlns:core="http://service.bni.co.id/core">
          <errorNum>1811</errorNum>
          <errorDescription>REK. atau TELLER DIMAKSUD
          SLH</errorDescription>
        </core:transaction_appFault>
      </detail>
    </soapenv:Fault>
  </soapenv:Body>
</soapenv:Envelope>
